<a href="https://colab.research.google.com/github/alanwuha/ce7455-nlp/blob/master/intro_to_panda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Intro to pandas

__Learning Objectives:__
- Gain an introduction to the `DataFrame` and `Series` data structures of the _pandas_ library
- Access and manipulate data within a `DataFrame` and `Series`
- Import CSV data into a _pandas_ `DataFrame`
- Reindex a `DataFrame` to shuffle data

# Basic Concepts

The following line imports the _pandas_ API and prints the API version:

In [1]:
from __future__ import print_function

import pandas as pd
pd.__version__

'0.25.3'

The primary data structures in _pandas_ are implemented as two classes:

- `DataFrame`, which you can imagine as a relational data table, with rows and named columns.
- `Series`, which is a single column. A `DataFrame` contains one or more `Series` and a name for each `Series`.

The data frame is a commonly used abstraction for data manipulation. Similar implementations exist in [Spark](#) and [R](#).

One way to create a `Series` is to construct a `Series` object. For example:

In [2]:
pd.Series(['San Francisco', 'San Jose', 'Sacramento'])

0    San Francisco
1         San Jose
2       Sacramento
dtype: object

In [4]:
pd.Series(['NUS', 'NTU', 'SMU'])

0    NUS
1    NTU
2    SMU
dtype: object

`DataFrame` objects can be created by passing a `dict` mapping `string` column names to their respective `Series`. If the `Series` don't match in length, missing values are filled with special [NA/NaN](#) values. Example:

In [8]:
pd.DataFrame({'abbreviation': ['NUS', 'NTU', 'SMU'], 'university': ['National University of Singapore', 'Nanyang Technological University', 'Singapore Management University'] })

city_names = pd.Series(['San Francisco', 'San Jose', 'Sacremento'])
population = pd.Series([852469, 1015785, 485199])

pd.DataFrame({ 'City name': city_names, 'Population': population })

       City name  Population
0  San Francisco      852469
1       San Jose     1015785
2     Sacremento      485199